Revit 2027 API
BuiltInFailures.EditingFailures.SourceInEditMode Property
 Can't transfer project standards while source document is in an edit mode. Please exit all edit modes(In-Place Family Edit Mode, Group Edit Mode, Sketch Edit Mode, etc.) and try again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SourceInEditMode { get; }
Public Shared ReadOnly Property SourceInEditMode As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SourceInEditMode {
	FailureDefinitionId^ get ();
}
static member SourceInEditMode : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace